#include "print_text.h"

void print_i_line(int tab)
{
    printf("\n");
	for (int i = 0; i < tab; i++)
	    printf(" ");
    printf("ЦЕЛ: 01---5----10---15---20---25---30\n");
	for (int i = 0; i < tab; i++)
	    printf(" ");
	printf("     ||   |    |    |    |    |    |\n");
	printf("\n");
}

void print_f_line(int tab)
{
    printf("\n");
	for (int i = 0; i < tab; i++)
	    printf(" ");
    printf("ДЕЙ: 01---5----10---15---20---25---30-01---5\n");
	for (int i = 0; i < tab; i++)
	    printf(" ");
	printf("     ||   |    |    |    |    |    || ||   |\n");
	printf("\n");
}

void print_menu(void)
{
    printf("\n");
	printf("--МЕНЮ:--\n");
	printf("Программа умножает действительное число на целое.\n");
	printf("------------------------------------------------------------\n");
	printf("Формат действительного:  +/-m.nE+/-K    |m|+|n|<=30 |K|<=5\n");
	printf("Формат целого:           +/-d           |d|<=30\n");
	printf("Формат вывода:           +/-0.m1E+/-K1  |m1|<=30    |K1|<=5\n");
	printf("------------------------------------------------------------\n");	
	printf("\n");
	printf("--Доступные действия:--\n");
	/*
	printf("1) Произвести тестовый ввод целого;\n");
	printf("2) Произвести тестовый ввод действительного;\n");
	printf("3) Произвести тестовый сдвиг;\n");
	printf("4) Произвести тестовую нормализацию;\n");
	*/
	printf("5) Произвести умножение действительного числа на целое;\n");
	printf("6) Завершить выполнение;\n");
	printf("\n");
    printf(">");	
}